Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge
Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartsCannotBeMerged
This PartMaker refers to parts which cannot be merged.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartNotIncludedInMerge
This part is not geometrically coincident with another part of the same material. No merge possible.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.NeedTwoPartsToMerge
Attempt to merge fewer than two parts. There must be at least two. No part will be produced.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.MergedPartHasDisConnectedGeometries
A merged part geometry has dis-connected components.

Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures
Failures related to part merge operations.